_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_1 (Dense)              (None, 512)               373248
_________________________________________________________________
dropout (Dropout)            (None, 512)               0
_________________________________________________________________
batch_normalization (BatchNo (None, 512)               2048
_________________________________________________________________
dense_2 (Dense)              (None, 512)               262656
_________________________________________________________________
dropout_1 (Dropout)          (None, 512)               0
_________________________________________________________________
batch_normalization_1 (Batch (None, 512)               2048
_________________________________________________________________
dense_3 (Dense)              (None, 384)               196992
_________________________________________________________________
dropout_2 (Dropout)          (None, 384)               0
_________________________________________________________________
batch_normalization_2 (Batch (None, 384)               1536
_________________________________________________________________
reshape_1 (Reshape)          (None, 1, 6, 64)          0
_________________________________________________________________
sequential (Sequential)      (None, 6, 26, 1)          37505
_________________________________________________________________
sequential_1 (Sequential)    (None, 150)               22650
=================================================================
Total params: 898,683
Trainable params: 895,867
Non-trainable params: 2,816

dropouts: 0.3
